package by.introduction.first.leaner1.main;
/*
1. Basics of sowtware code development

   Циклы 
   
6. Вывести на экран соответствий между символами и их численными обозначениями в памяти 
   компьютера.
*/
public class Solution17 {
	public static void main(String[] args) {

		for (int i = 33; i <= 122; i++) {
			System.out.println("dec " + i + " symbol " + (char)i);
		}
	}
}
